Repository: neolithos/neolua
Catalog: NeoLua/Properties/Resources.*.resx
Languages: de

# rsBindConversionNotDefined
source: No conversion defined from {0} to {1}.
de: Keine Konvertierung von {0} nach {1} definiert.

# rsBindOperatorNotDefined
source: No operator is defined for {1} {0} {2}.
de: Kein Operator für {1} {0} {2} definiert.

# rsChunkNotCompiled
source: Chunk is not compiled.
de: Chunk ist nicht übersetzt.

# rsClrGenericNoType
source: No type for the generic argument {0}.
de: Kein Type für den generischen Parameter {0} gefunden.

# rsClrGenericTypeExpected
source: Clr type expected.
de: Clr-Type erwartet.

# rsConstExpressionEvalError
source: Constant expression could not evaluate ({0}).
de: Konstanter Ausdruck konnte nicht ausgewertet werden ({0}).

# rsConstExpressionNeeded
source: Constant expression expected.
de: Konstanter Ausdruck erwartet.

# rsCoroutineInvalidAR
source: Argument ar must from the same LuaThread.
de: Argument ar muss vom selben LuaThread stammen.

# rsCoroutineInvalidCO
source: Argument co must be a LuaThread or a Thread.
de: Argument co muss ein LuaThread oder Thread sein.

# rsCoroutineNoBeginResume
source: BeginResume is not called.
de: BeginResume wurde nicht aufgerufen.

# rsCoroutineWrongThread
source: Yield from wrong thread.
de: Yield wurde vom falsche Thread aus gerufen.

# rsDelegateCouldNotHaveOut
source: Delegate must not have out parameters.
de: Delegates dürfen keine Ausgabeparameter haben.

# rsExpressionNotEnumerable
source: Expression is not enumerable.
de: Expression ist nicht IEnumerable.

# rsFileInvalidModeFormat
source: Invalid mode format.
de: Format für mode-parameter nicht erkannt.

# rsFileNotReadable
source: Can not read from file.
de: Datei kann nicht gelesen werden.

# rsFileNotSeekable
source: File pointer can not set to a new position.
de: Dateizeiger kann nicht neu positioniert werden.

# rsFileNotWriteable
source: Can not write into file.
de: In die Datei kann nicht geschrieben werden.

# rsFormatError
source: Can not format '{0}' to {1}.
de: '{0}' kann nicht in '{1}' konvertiert werden.

# rsGlobalFunctionNotUnique
source: Function '{0}' on type '{1}' already exists.
de: Funktion '{0}' wurde bereits in '{1}' definiert.

# rsIndexNotFound
source: No index found for type '{0}'.
de: '{0}' hat keinen Index.

# rsInvokeNoDelegate
source: Type '{0}' is not callable.
de: '{0}' kann nicht aufgerufen werden.

# rsMemberNotReadable
source: '{0}:{1}' is not readable.
de: '{0}:{1}' kann nicht gelesen werden.

# rsMemberNotResolved
source: '{0}:{1}' not found.
de: '{0}:{1}' nicht gefunden.

# rsMemberNotUnique
source: '{0}:{1}' must be unique.
de: '{0}:{1}' nicht eindeutig.

# rsMemberNotWritable
source: '{0}:{1}' is not writable.
de: '{0}:{1}' nicht schreibbar.

# rsMethodStaticMix
source: Can not mix static and non-static methods ({0}).
de: Es ist nicht möglich statische mit nicht statischen Methoden zu vermischen ({0}).

# rsNilNotCallable
source: Can not call nil value.
de: Nil kann nicht aufgerufen werden.

# rsNilOperatorError
source: Operator is not defined for nil-values.
de: Operator ist nicht für nil definiert.

# rsNoLengthOperator
source: No length for {0}.
de: Keine Länge für {0}.

# rsNullReference
source: Object is nil.
de: Objekt ist nil.

# rsNumberExpected
source: Number expected.
de: Zahl erwartet.

# rsParseAssignmentExpected
source: Assignment expected.
de: Zuweisung erwartet.

# rsParseCatchVarTypeMustAssignableToException
source: The argument type must be assignable to Exception (unexpected type: {0})
de: Das Argument muss kompatible zu Exception sein (unerwarteter type: {0})

# rsParseConvertNumberError
source: Number expected ('{0}' not converted).
de: Zahl erwartet ('{0}' nicht konvertiert).

# rsParseEof
source: Current block is closed before end of file.
de: Block vor Dateiende geschlossen.

# rsParseExpressionNoResult
source: Expression has no result.
de: Ausdruck hat kein Ergebnis.

# rsParseExpressionNotAssignable
source: Expression is not assignable.
de: Ausdruck kann nichts zugewiesen werden.

# rsParseInvalidArgList
source: Named arguments specifications must appear after all fixed arguments have been specified.
de: Benannte Argumente können erst festgelegt werden, wenn alle positionierten Argumente angegeben wurden.

# rsParseInvalidChar
source: Unexpected char.
de: Unerwartetes Zeichen.

# rsParseInvalidComment
source: Comment not closed.
de: Kommentar wurde nicht geschlossen.

# rsParseInvalidString
source: NewLine in string constant.
de: Zeilenumbruch in Zeichenfolge.

# rsParseNoArgList
source: No arglist defined.
de: Keine Argumentenliste definiert.

# rsParseTypeRedef
source: It is not allowed to redefine the type.
de: Es nicht erlaubt den Type neu zu definieren.

# rsParseUnexpectedToken
source: Unexpected token '{0}'. '{1}' expected.
de: '{1}' erwartet, aber '{0}' gefunden.

# rsParseUnexpectedTokenElse
source: Unexpected token in Else-Statement
de: Unerwarteter Token in Else-Statement.

# rsParseUnexpectedTokenPrefix
source: Literal, function or table-ctor expected.
de: Literal, Function oder Tabelle erwartet.

# rsParseUnknownType
source: Type '{0}' not found.
de: Typ '{0}' nicht gefunden.

# rsStackTraceAt
source: at
de: bei

# rsStackTraceInternal
source: -- internal --
de: -- Intern --

# rsStackTraceLine
source: line
de: Zeile

# rsStackTraceUnknownMethod
source: <unknown method>
de: <Unbekannte Methode>

# rsTableAddDuplicate
source: There is already a value with the key '{0}'.
de: Eintrag mit Key '{0}' schon vorhanden.

# rsTableCallMemberFailed
source: Failed to call '{0}'.
de: Fehler bei der Ausführung von '{0}'.

# rsTableKeyNotNullable
source: Nil is not a valid key.
de: Nil ist kein gültiger Key.

# rsTableMethodExpected
source: Methods must have a LuaTable as first parameter ('{0}').
de: Methoden benötigen eine LuaTable als ersten Parameter ('{0}').

# rsTableOperatorIncompatible
source: Operator '{0}' is not compatible (expected {1}).
de: Operator '{0}' ist nicht kompatibel (erwartet {1}).

# rsTableOperatorNotFound
source: Operator '{0}' is not defined for the table.
de: Operator '{0}' ist für die Table nicht definiert.

# rsTableRecursionLevelError
source: Recursion level is to deep.
de: Tabelle ist zu tief geschachtelt.

# rsTypeAliasInvalidName
source: Name for type alias is invalid '{0}'.
de: Name für Type ist ungültig '{0}'.

# rsTypeExtentionInvalidMethod
source: Method {0}.{1} must be static, public and needs at least one parameter.
de: Die Methode {0}.{1} muss static, public und einen Parameter haben.

# rsTypeExtentionInvalidType
source: {0} is not static.
de: {0} muss static sein.

# rsTypeInvalidType
source: '{0}' is a pointer or byref type. These types can not converted to a LuaType.
de: Bei '{0}' handelt es sich um einen GenericParamater-, Pointer- oder Byreftyp. Die Typen können nicht in einen LuaType umgewandelt werden.

# rsTypeIsNotSupported
source: The type "{0}" is not supported.
de: Type '{0} wird nicht unterstützt.

# rsTypeParseError
source: Invalid type format for '{0}' (unexpected: {1} at {2}; expected: {3})
de: Ungültige Typebeschreibung '{0}' (unerwartet: {1} bei {2}; erwartet: {3})
